MarKo7s/swept-source-trigger-interferometer/psoc5/firmware/PSOC_trigger_firmware_Trigger_Polarity_Low/Trigger.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ref_aliases.h"
#include "ref.h"
#include "BPD_in_aliases.h"
#include "BPD_in.h"
#include "Comp.h"
#include "comp_out_monitor_aliases.h"
#include "comp_out_monitor.h"
#include "sw_aliases.h"
#include "sw.h"
#include "Clock_1.h"
#include "Counter.h"
#include "count_out_aliases.h"
#include "count_out.h"
#include "PWM.h"
#include "Clock_2.h"
#include "UART.h"
#include "isr_count.h"
#include "isr_sw.h"
#include "freqcounter.h"
#include "Timer.h"
#include "isr_timer.h"
#include "isr_swStart.h"
#include "muxSel.h"
#include "UART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

